src/cf/InformationRegisters/инт_ХешиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ХешиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>59</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Comment>Сериализованное представление исходных данных (ЗначениеВСтрокуВнутр)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ХешиОбъектов/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// инт_ХешиОбъектов
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьХэшОбъекта(ИсходныеДанные, ПотокДанных, Отказ = Ложь) Экспорт
	
		Хеш = ПолучитьХешОбъектаПоПотоку(ИсходныеДанные, ПотокДанных);
		
		Если Не ЗначениеЗаполнено(Хеш) Тогда
			// чет не так с получением хеша... от греха подальше ничего не делаем, но в отказ не падаем, потому что лучше зарегистрировать, чем нет.
			Возврат;
		КонецЕсли;
		
		Если НЕ ДанныеИзменились(ИсходныеДанные, ПотокДанных, Хеш) Тогда
			// Данные с последнего раза не поменялись. Ничего не записываем - и возвращаем отказ.
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		// с прошлого раза данные поменялись, Обновим хеш и 
		Запись = РегистрыСведений.инт_ХешиОбъектов.СоздатьМенеджерЗаписи();
		Запись.ИсходныеДанные = ЗначениеВСтрокуВнутр(ИсходныеДанные);
		Запись.ПотокДанных = ПотокДанных;
		Запись.Хеш = Хеш;
		Запись.Записать(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеИзменились(ИсходныеДанные, ПотокДанных, Хеш)
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	инт_ХешиОбъектов.ИсходныеДанные КАК ИсходныеДанные
	               |ИЗ
	               |	РегистрСведений.инт_ХешиОбъектов КАК инт_ХешиОбъектов
	               |ГДЕ
	               |	инт_ХешиОбъектов.ИсходныеДанные = &ИсходныеДанные
	               |	И инт_ХешиОбъектов.ПотокДанных = &ПотокДанных
	               |	И инт_ХешиОбъектов.Хеш = &Хеш";
	Запрос.УстановитьПараметр("ИсходныеДанные", ЗначениеВСтрокуВнутр(ИсходныеДанные));
	Запрос.УстановитьПараметр("ПотокДанных",ПотокДанных);
	Запрос.УстановитьПараметр("Хеш", Хеш);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПолучитьХешОбъектаПоПотоку(ИсходныеДанные, ПотокДанных)
	ХешСтрокой = "";
	Если НЕ ЗначениеЗаполнено(ПотокДанных.ОтслеживаемыеРеквизиты) Тогда
		// Если, ну почему-то оно не заполнено - просто говорим, что это не дубль.
		Возврат ХешСтрокой;
	КонецЕсли;
	ДеревоОтслеживаемыхРеквизитов = ЗначениеизСтрокиВнутр(ПотокДанных.ОтслеживаемыеРеквизиты);
	Попытка
		Хеширование=Новый ХешированиеДанных(ХешФункция.SHA1);
		Хеширование.Добавить(ПолучитьСсылкуСтрокой(ИсходныеДанные, ДеревоОтслеживаемыхРеквизитов));
		ХешСтрокой = Строка(Хеширование.ХешСумма);
	Исключение
	    СообщениеОбОшибке = СтрШаблон("При поптыке вычислить хеш объекта <%1> по потоку <%2> произошла ошибка!
		|
		|Информация об ошибке: %3", ИсходныеДанные, ПотокДанных, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ОчередьИсходящихСообщений.ХэшированиеОбъекта", УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
		Возврат ХешСтрокой;
	КонецПопытки;
	
	Возврат ХешСтрокой;
КонецФункции

Функция ПолучитьСсылкуСтрокой(Ссылка, ДеревоОтслеживаемыхРеквизитов)
	МетаданныеОбъекта = Ссылка.Метаданные();
	СтрокаПоля = ОбойтиУзелДерева(ДеревоОтслеживаемыхРеквизитов.Строки, МетаданныеОбъекта);
	Если НЕ ЗначениеЗаполнено(СтрокаПоля)  Тогда
		ВызватьИсключение "В дереве отслеживаемых реквизитов нет ни одного отслеживаемого реквизита!";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон("Выбрать %1 из %2 Где Ссылка=&Ссылка", СтрокаПоля, МетаданныеОбъекта.ПолноеИмя());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат ЗначениеВСтрокуВнутр(Запрос.Выполнить().Выгрузить());
КонецФункции

Функция ОбойтиУзелДерева(Строки, МетаданныеОбъекта)
	// Поля, которых больше нет в метаданных объекта, в список не попадают: состав полей запроса меняется,
	// а вместе с ним и хеш, поэтому объект считается изменившимся и уходит получателям. Отправить лишний
	// раз безопаснее, чем прервать обмен ошибкой обращения к удаленному реквизиту.
	СтрокаРезультат = "";
	Для Каждого Строка Из Строки Цикл
		Если Строка.ОтслеживатьИзменения = 0 Тогда
			// Этот элемент не отслеживается.
			Продолжить;
		КонецЕсли;
		
		Если Строка.Имя = "Реквизиты" Тогда
			СтрокаРезультат = ДополнитьСписокПолей(СтрокаРезультат,
				ПоляРеквизитов(Строка.Строки, МетаданныеОбъекта.Реквизиты));
		ИначеЕсли Строка.Имя = "СтандартныеРеквизиты" Тогда
			СтрокаРезультат = ДополнитьСписокПолей(СтрокаРезультат,
				ПоляРеквизитов(Строка.Строки, МетаданныеОбъекта.СтандартныеРеквизиты));
		ИначеЕсли Строка.Имя = "ТабличныеЧасти" Тогда
			СтрокаРезультат = ДополнитьСписокПолей(СтрокаРезультат,
				ПоляТабличныхЧастей(Строка.Строки, МетаданныеОбъекта.ТабличныеЧасти));
		Иначе
			// Узел самого объекта: его поля собираются по подчиненным узлам.
			СтрокаРезультат = ДополнитьСписокПолей(СтрокаРезультат,
				ОбойтиУзелДерева(Строка.Строки, МетаданныеОбъекта));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокаРезультат;
КонецФункции

Функция ПоляРеквизитов(Строки, КоллекцияРеквизитов)
	СписокПолей = "";
	Для Каждого Строка Из Строки Цикл
		Если Строка.ОтслеживатьИзменения = 0 Или Не РеквизитСуществует(КоллекцияРеквизитов, Строка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		СписокПолей = ДополнитьСписокПолей(СписокПолей, Строка.Имя);
	КонецЦикла;
	
	Возврат СписокПолей;
КонецФункции

Функция ПоляТабличныхЧастей(Строки, КоллекцияТабличныхЧастей)
	СписокПолей = "";
	Для Каждого Строка Из Строки Цикл
		ТабличнаяЧасть = КоллекцияТабличныхЧастей.Найти(Строка.Имя);
		Если ТабличнаяЧасть = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПоляТабличнойЧасти = ПоляРеквизитов(Строка.Строки, ТабличнаяЧасть.Реквизиты);
		// Табличная часть без пригодных полей в запрос не включается: конструкцию вида ТЧ.() платформа
		// принимает, но менять из-за нее состав полей, а вместе с ним и хеши, нежелательно.
		Если ЗначениеЗаполнено(ПоляТабличнойЧасти) Тогда
			СписокПолей = ДополнитьСписокПолей(СписокПолей, СтрШаблон("%1.(%2)", Строка.Имя, ПоляТабличнойЧасти));
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокПолей;
КонецФункции

Функция РеквизитСуществует(КоллекцияРеквизитов, ИмяРеквизита)
	// Коллекция стандартных реквизитов не поддерживает метод Найти, поэтому поиск идет перебором.
	Для Каждого Реквизит Из КоллекцияРеквизитов Цикл
		Если Реквизит.Имя = ИмяРеквизита Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция ДополнитьСписокПолей(СписокПолей, Поле)
	Если Не ЗначениеЗаполнено(Поле) Тогда
		Возврат СписокПолей;
	КонецЕсли;
	
	Возврат СписокПолей + ?(СписокПолей = "", "", ",") + Поле;
КонецФункции

#КонецОбласти

#КонецЕсли
